def pora_roky02():
    s = int (input("Введіть номер місяця: "))
    if s == 12 or s== 1 or s== 2 :
        print("Це зима, місяць грудень")
    elif s == 1:
        print("Це зима, місяць січень")
    elif s == 2:
        print("Це зима, місяць лютий")
    elif s == 3:
        print("Це весна, місяць березень")
    elif s == 4:
        print("Це зима, місяць квітень")
    elif s == 5:
        print("Це зима, місяць травень")
    elif s == 6 or s== 7 or s== 8 :
        print("Це літо, просто радійте йому")
    elif s == 9 or s== 10 or s== 11 :
        print("Це осінь, готуйте парасольку")
    elif s > 13:
        print("Уроці тількі 12 місяців \nВведіть число від 1 до 12")

pora_roky02()
import __hello__